Repository: BorisE/wsm
Catalog: WeatherStation/SettingsForm.*.resx
Languages: ru

# btnCancel.Text
source: Cancel
ru: Отмена

# btnReset.Text
source: Reset to Defaults
ru: По умолчанию

# $this.Text
source: Settings
ru: Настройки

# label34.Text
source: sec
ru: сек.

# label31.Text
source: sec
ru: сек.

# label33.Text
source: Send data to narodmon every
ru: Отправлять каждые

# label30.Text
source: Send data to web every
ru: Отправлять каждые

# btnGenerateMac.Text
source: Generate
ru: Генер.

# chkNarodMon.Text
source: Send data to NARODMON.RU
ru: Отправлять на NARODMON.RU

# chkWebData.Text
source: Send data to web server
ru: Отправлять данные на web сервер

# groupBox11.Text
source: Web server
ru: Интернет

# chkShowDebugPannels.Text
source: Show debug elements
ru: Показывать элементы для отладки

# chkTrayIcon.Text
source: Minimize to system tray
ru: Минимизировать в трей

# chkMinMode.Text
source: Minimize button switch program to MIN MODE
ru: Переключение в минималистический режим

# groupBox8.Text
source: Interface options
ru: Интерфейс

# label10.Text
source: Logging level
ru: Детализация

# cmbLogLevel.Items
source: 1 - Common messages
ru: 1 - Основные сообщения

# cmbLogLevel.Items1
source: 2 - Prog activity
ru: 2 - Активность программы

# cmbLogLevel.Items2
source: 3 - All debug info
ru: 3 - Отладка

# cmbLogLevel.Text
source: 1 - Common messages
ru: 1 - Основные сообщения

# cmbLogLevel.ToolTip
source: Logging level. 1 - recomended
ru: Уровень детализации логов. Рекомендуется 1 или если все идет не так, то второй. Третий скорее для разработчика

# chkBoltwoodFileFlag.Text
source: Boltwood CS file
ru: Файл состояния

# chkSerialLogFileFlag.Text
source: Serial log file
ru: Лог порта

# chkCSVFileFlag.Text
source: Data CSV file
ru: Лог данных

# chkLogFileFlag.Text
source: Program log file
ru: Лог программы

# groupBox3.Text
source: Log data
ru: Логи

# label32.Text
source: millisec
ru: миллисек.

# label14.Text
source: Main tick interval
ru: Интервал обновления

# label39.Text
source: Max log window lines
ru: Макс. строк в окне лога

# label15.Text
source: Max points on graph
ru: Макс.точек на графике

# txtMaxLogWindowLines.ToolTip
source: Max number of lines displayed in a log window. Full log can be seen in serial log file (see above). Too large numbers will lead to memory consumption. Default 500 lines.
ru: Максимальное количество строк в окне отображения лога. Полный лог (если есть необходимость) можно получить включив запись лога порта (см.выше). Слишком большие значения приведут к большему потреблению памяти. По умолчанию 500 строк.

# groupBox6.Text
source: Productivity settings
ru: Производительность

# label37.Text
source: Write to file
ru: Писать в

# label36.Text
source: Read from file
ru: Читать из

# txtSerialFileIn.ToolTip
source: File name from which program reads serial data in In Serial File Emulation Mode (disabled in normal serial port mode)
ru: Путь к файлу в режиме Serial File Emulation, из которого программа будет читать данные. Недоступно в нормально режиме

# chkWatchdog.Text
source: Connection watchdog
ru: Отслеживание соединения

# groupBox1.Text
source: Serial port
ru: COM порт

# tabGeneral.Text
source: General
ru: Общие

# label28.Text
source: m/s
ru: м/с

# label29.Text
source: m/s
ru: м/с

# label26.Text
source: Windy threshold
ru: "Ветренно"

# label21.Text
source: Zero speed
ru: Нулевой порог

# label23.Text
source: Very windy threshold
ru: "Очень ветренно"

# groupBox12.Text
source: Wind Speed Sensor model
ru: Скорость ветра

# groupBox10.Text
source: AAG Cloud Sensor model
ru: Модель AAG

# label42.Text
source: Primary
ru: mm в отcчете

# btnSetGaugeInc.Text
source: Set
ru: Установить

# btnSetGaugeInc.ToolTip
source: Manually set value for incremental rain counter
ru: Установить значение накопительного счетчика осадков

# label12.Text
source: Wet threshold
ru: Порог "влажно"

# cmbWetMode.Items
source: Use both
ru: Оба датчика

# cmbWetMode.Items1
source: Wet only
ru: Wet sensor только

# cmbWetMode.Items2
source: RGC only
ru: RGC только

# cmbWetMode.Text
source: Use both
ru: Оба датчика

# label41.Text
source: Y axis upper limit
ru: Масштаб показаний RGC

# label40.Text
source: Y axis lower limit
ru: Сброс накоп.значения

# label19.Text
source: Rain sensors mode
ru: Режим датчиков дождя

# label13.Text
source: Rain threshold
ru: Порог "дождь"

# txtGaugeInc.ToolTip
source: All time RG-11 rain counter incremental value. It used by narodmon to display rain intensity. Can be manually set to any value by entering it here and pressing "Set" button
ru: Текущее значение накопительного счетчика осадков RG-11 Используется для narodmon из-за их особого алгоритма обработки данных В этом окне можно вручную установить нужно значение, введя его в окне и нажав кнопку "Установить"

# groupBox5.Text
source: Rain sensor model
ru: Датчики дождя

# label2.Text
source: Cloudy/Very cloudy sky threshold
ru: Порог "облачно"/"оч.облачно"

# label1.Text
source: Clear/Cloudy sky threshold
ru: Порог "ясно"/"облачно"

# groupBox2.Text
source: Classic Cloud Sensor model
ru: Датчик облачности

# tabModeling.Text
source: Cloud
ru: Модели

# SensorName.HeaderText
source: Sensor
ru: Сенсор

# SensorEnabled.HeaderText
source: Enabled
ru: Вкл

# SensorType.HeaderText
source: Type
ru: Тип

# SendToWeb.HeaderText
source: Send to Web
ru: Web

# SendToNarodmon.HeaderText
source: Send to Narodmon
ru: Narodmon

# ArduinoName.HeaderText
source: Arduino Name
ru: Имя в Arduino

# WebCustomName.HeaderText
source: Web VAR name
ru: Web имя

# FormFieldName.HeaderText
source: TextField name
ru: TextField имя

# label9.Text
source: Base temp sensor
ru: Датчик температуры

# groupBox7.Text
source: Base temp sensor
ru: Основной датчик температуры

# btnResetSensorList.Text
source: Reset sensor list to default
ru: Значения по умолчанию

# btnReadFromSerial.Text
source: Read from serial port
ru: Читать из порта

# tabSensors.Text
source: Sensors
ru: Сенсоры

# label24.Text
source: Heater pause time
ru: Пауза между включениями

# label18.Text
source: CS decreasing threshold
ru: Порог снижения

# label25.Text
source: CS threshold switching on
ru: Порог включения

# groupBox9.Text
source: CS auto heater settings
ru: Автообогрев датчика облачности

# label11.Text
source: Max temperature delta
ru: Макс. разница температур

# label17.Text
source: Wet threshold switching on
ru: Порог включения по Wet

# label16.Text
source: Max cycle duration
ru: Макс. длительность

# groupBox4.Text
source: Heater settings
ru: Настройки обогрева

# tabHeater.Text
source: Heater
ru: Обогрев
